---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Point..::..Create Method
Point Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(XYZ) | Creates a point at the given coordinates. |
|  | Create(XYZ, ElementId) | Creates a point at the given coordinates and assigns it the specified GraphicsStyle. |

# See Also

Point Class

Point Members

Autodesk.Revit.DB Namespace